Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkLoadContent.SetExtendedPropertiesLinkData(Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkData)
Sets the extended properties data from the external server.
data:
The extended properties data to set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The extended properties data does not contain a valid container name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkLoadContent
Represents the data needed to establish or update an ExtendedPropertiesLink.
To be used as the result of invoking an external server in order to
update or create an ExtendedPropertiesLink.
Since:
2027